# **Structured Query Language**

- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

## Database Structures

- In SQL, data is stored in tables, which are organized into databases.
- Each table consists of **rows** and **columns**
- `Rows` represent individual record, `Columns` represent attributes or fields of those records

%pip install ipython-sql

In [1]:
%pip install ipython-sql

Requirement already satisfied: ipython-sql in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (0.5.0)
Requirement already satisfied: prettytable in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (8.25.0)
Requirement already satisfied: sqlalchemy>=2.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (2.0.30)
Requirement already satisfied: sqlparse in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (0.5.0)
Requirement already satisfied: six in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.3)
Requirement already satisfied: decorator in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: pexpect>4.3 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: wcwidth in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing>=1.2.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in /Users/dreamstore/Desktop/DPT01/venv/lib/python3.12/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Note: you may need to restart the kernel to use updated packages.

### Load the SQL Extension

In [2]:
%load_ext sql

### Create SQLite Database

In [3]:
%sql sqlite:///sample-database.db

## Create Table

Syntax:
```
%%sql CREATE TABLE IF NOT EXISTS table-name (
    column1 data-type constraint,
    column2 data-type constraint,
    ...,
    columnN data-type constraint
);
```

% single line

%% multi line

In [4]:
%%sql 
-- Creating a Table
CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sample-database.db
Done.

[]

%%sql 
-- Dropping a Table (Deleting)
DROP TABLE employees;

### Check if the employee table is created successfully

In [5]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sample-database.db
Done.

[('sqlite_sequence',), ('employees',)]

### Altering Table

Syntax:
```
%%sql ALTER TABLE table-name
ADD column-name data-type;
```

In [6]:
%%sql ALTER TABLE employees
ADD hire_date DATE;

 * sqlite:///sample-database.db
(sqlite3.OperationalError) duplicate column name: hire_date
[SQL: ALTER TABLE employees
ADD hire_date DATE;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [7]:
%%sql ALTER TABLE employees
ADD performance_rating INT;

 * sqlite:///sample-database.db
(sqlite3.OperationalError) duplicate column name: performance_rating
[SQL: ALTER TABLE employees
ADD performance_rating INT;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%%sql
-- Checking our table's structure
PRAGMA table_info('employees');

 * sqlite:///sample-database.db
Done.

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0),
 (5, 'hire_date', 'DATE', 0, None, 0),
 (6, 'performance_rating', 'INT', 0, None, 0)]

## Inserting Data
Syntax:
```
%%sql
INSERT INTO table-name (column1, column2, ..., columnN) 
VALUES (value1, value2, ..., valueN);
```

In [9]:
%%sql
-- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (1, 'John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3)

 * sqlite:///sample-database.db
1 rows affected.

[]

%%sql
-- auto-increment

INSERT INTO employees (first_name, last_name, department, salary, hire_date, performance_rating)
VALUES ('John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3)

we can rename column table

%%sql

alter table employees rename column hire_date to hired_date;

## Selecting Data

Syntax:
```
%sql SELECT * FROM table-name;
```

In [10]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-05-30', 3)]

### Select Specific Columns

Syntax:
```
%%sql SELECT column1, column2, ..., columnN 
FROM table-name;
```

In [11]:
%sql SELECT first_name, last_name, department FROM employees;

 * sqlite:///sample-database.db
Done.

[('John', 'Doe', 'Sales')]

## Update Data
Syntax:
```
UPDATE table-name 
SET column-name = new-data 
WHERE primary-key = value;
```

In [12]:
%%sql UPDATE employees
SET first_name = "Jane"
WHERE employee_id = 1;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [13]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'Jane', 'Doe', 'Sales', 50000, '2024-05-30', 3)]

#### Inserting more data

In [14]:
%%sql
-- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (2, 'Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
(3, 'Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
(4, 'Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
(5, 'Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sample-database.db
4 rows affected.

[]

%%sql
-- auto-increment

INSERT INTO employees (first_name, last_name, department, salary, hire_date, performance_rating)
VALUES ('Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
('Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
('Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
('Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);

In [15]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'Jane', 'Doe', 'Sales', 50000, '2024-05-30', 3),
 (2, 'Huy', 'Vo', 'Marketing', 55000, '2024-04-25', 4),
 (3, 'Al', 'H', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Ferds', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'Jared', 'Neil', 'Operations', 58000, '2024-04-28', 1)]

## Deleting Data

Syntax:
```
DELETE FROM table-name
WHERE primary-key = value;
```

In [16]:
%%sql DELETE FROM employees
WHERE employee_id = 2;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [17]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'Jane', 'Doe', 'Sales', 50000, '2024-05-30', 3),
 (3, 'Al', 'H', 'Sales', 60000, '2024-04-26', 5),
 (4, 'Ferds', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (5, 'Jared', 'Neil', 'Operations', 58000, '2024-04-28', 1)]